benchmark/results/pre-redis/wrk_conns_1000_console.log
Running 30s test @ http://localhost:8000/api/v1/posts/9/
  8 threads and 1000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.22s   300.01ms   2.00s    71.73%
    Req/Sec    99.77     43.92   260.00     70.03%
  23056 requests in 30.10s, 14.07MB read
  Socket errors: connect 0, read 0, write 0, timeout 1107
Requests/sec:    766.06
Transfer/sec:    478.81KB

=== hot post benchmark (wrk) ===
requests: 23056  throughput: 766.06 req/s  errors(non-200): 0
latency avg: 1218.24ms  p50: 1177.88ms  p90: 1653.24ms  p95: 1788.85ms  p99: 1945.93ms  max: 1999.91ms
socket errors: connect=0 read=0 write=0 timeout=1107