benchmark/results/pre-redis/wrk_conns_1000_multiuser_console.log
Running 30s test @ http://localhost:8000/api/v1/posts/9/
  8 threads and 1000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   550.40ms  143.36ms   1.51s    74.49%
    Req/Sec   226.71     67.95   500.00     69.33%
  53904 requests in 30.05s, 32.95MB read
Requests/sec:   1793.62
Transfer/sec:      1.10MB

=== hot post benchmark (wrk) ===
pool_size: 100
requests: 53904  throughput: 1793.62 req/s  errors(non-200): 0
latency avg: 550.40ms  p50: 528.30ms  p90: 735.50ms  p95: 812.80ms  p99: 979.58ms  max: 1512.44ms
socket errors: connect=0 read=0 write=0 timeout=0