benchmark/results/pre-redis/wrk_conns_100_multiuser_console.log
Running 30s test @ http://localhost:8000/api/v1/posts/9/
  8 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    49.57ms   39.54ms 442.41ms   77.43%
    Req/Sec   267.78     59.61   460.00     72.21%
  64000 requests in 30.09s, 39.14MB read
Requests/sec:   2126.77
Transfer/sec:      1.30MB

=== hot post benchmark (wrk) ===
pool_size: 100
requests: 64000  throughput: 2126.77 req/s  errors(non-200): 0
latency avg: 49.57ms  p50: 40.83ms  p90: 100.45ms  p95: 124.36ms  p99: 183.39ms  max: 442.41ms
socket errors: connect=0 read=0 write=0 timeout=0