benchmark/results/pre-redis/wrk_conns_500_multiuser_console.log
Running 30s test @ http://localhost:8000/api/v1/posts/9/
  8 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   269.95ms  134.18ms   1.86s    81.85%
    Req/Sec   239.27     69.64   444.00     68.42%
  56406 requests in 30.10s, 34.49MB read
Requests/sec:   1873.96
Transfer/sec:      1.15MB

=== hot post benchmark (wrk) ===
pool_size: 100
requests: 56406  throughput: 1873.96 req/s  errors(non-200): 0
latency avg: 269.95ms  p50: 239.19ms  p90: 422.31ms  p95: 502.61ms  p99: 784.12ms  max: 1861.92ms
socket errors: connect=0 read=0 write=0 timeout=0